Repository: SimBoi/supreme-octo-eureka
Catalog: lib/l10n/app_*.arb
Languages: ar, he

source: Unexpected error
ar: خطأ غير متوقع
he: שגיאה בלתי צפויה

# clientException
source: HTTP Client exception
ar: استثناء عميل HTTP
he: שגיאת לקוח HTTP

source: Unexpected exception
ar: استثناء غير متوقع
he: שגיאה בלתי צפויה

source: Json format error
ar: خطأ في تنسيق JSON
he: שגיאת פורמט JSON

source: Lesson booked
ar: تم حجز الدرس
he: השיעור הוזמן

source: Lesson cancelled
ar: تم إلغاء الدرس
he: השיעור בוטל

source: Lesson accepted
ar: تم قبول الدرس
he: השיעור התקבל

source: Lesson does not exist
ar: الدرس غير موجود
he: השיעור לא קיים

source: Link updated
ar: تم تحديث الرابط
he: הקישור עודכן

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب
he: נדרש מספר טלפון

# invalidPhone
source: Invalid phone number
ar: رقم الهاتف غير صحيح
he: מספר טלפון לא חוקי

# phoneDoesntExist
source: Phone number does not exist
ar: رقم الهاتف غير موجود
he: מספר הטלפון לא קיים

# usernameLengthLessThan3
source: Username length should be 3 or more characters
ar: يجب أن يكون طول اسم المستخدم 3 أحرف أو أكثر
he: אורך שם המשתמש צריך להיות 3 תווים או יותר

# phoneExists
source: Phone number already exists
ar: رقم الهاتف موجود بالفعل
he: מספר הטלפון כבר קיים

# verificationCodeSent
source: Verification code sent successfully! The code is valid for {validMinutes} minutes.
ar: تم إرسال رمز التحقق بنجاح! الرمز صالح لمدة {validMinutes} دقيقة.
he: קוד אימות נשלח בהצלחה! הקוד תקף ל-{validMinutes} דקות.

# verificationCodeAlreadySent
source: Verification code already sent! Please wait for the cooldown to end before trying again.
ar: تم إرسال رمز التحقق بالفعل! الرجاء الانتظار حتى انتهاء مدة التبريد قبل المحاولة مرة أخرى.
he: קוד אימות כבר נשלח! נא להמתין עד לסיום תקופת הקירור לפני שתנסה שוב.

source: Error requesting verification code
ar: خطأ في طلب رمز التحقق
he: שגיאה בבקשת קוד האימות

# phoneVerified
source: Phone number verified successfully
ar: تم التحقق من رقم الهاتف بنجاح
he: מספר הטלפון אומת בהצלחה

# verificationCodeExpired
source: Verification code expired, please request a new one
ar: انتهت صلاحية رمز التحقق، يرجى طلب رمز جديد
he: קוד האימות פג תוקף, נא לבקש קוד חדש

source: Wrong verification code
ar: رمز التحقق غير صحيح
he: קוד אימות שגוי

source: Login
ar: تسجيل الدخول
he: התחברות

source: Phone
ar: رقم الهاتف
he: טלפון

source: Don't have an account?
ar: لا تملك حسابًا؟
he: אין לך חשבון?

source: Sign Up
ar: إنشاء حساب
he: הרשמה

# phoneLengthNot10
source: Phone number should be 10 digits
ar: يجب أن يكون رقم الهاتف 10 أرقام
he: מספר הטלפון צריך להכיל 10 ספרות

source: Username
ar: اسم المستخدم
he: שם משתמש

source: Already have an account?
ar: لديك حساب بالفعل؟
he: כבר יש לך חשבון?

# accountCreated
source: Account created successfully
ar: تم إنشاء الحساب بنجاح
he: החשבון נוצר בהצלחה

source: Verify Phone
ar: تحقق من الهاتف
he: אמת טלפון

# verifyPhoneDescription
source: We need to verify your phone number before you can continue. We will send you a verification code using WhatsApp to the following number:
ar: نحتاج إلى التحقق من رقم هاتفك قبل أن تتمكن من المتابعة. سنرسل لك رمز تحقق عبر واتساب إلى الرقم التالي:
he: אנו צריכים לאמת את מספר הטלפון שלך לפני שתוכל להמשיך. נשלח לך קוד אימות באמצעות WhatsApp למספר הבא:

source: Request code
ar: طلب الرمز
he: בקש קוד

source: Verification code
ar: رمز التحقق
he: קוד אימות

source: Confirm
ar: تأكيد
he: אישור

# verificationCodeLengthError
source: Verification code must be {length} digits
ar: يجب أن يكون رمز التحقق {length} رقمًا
he: קוד האימות צריך להיות {length} ספרות

source: Resend code
ar: إعادة إرسال الرمز
he: שלח קוד שוב

source: Resend code in
ar: إعادة إرسال الرمز بعد
he: שלח קוד שוב בעוד

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح
he: הפרופיל עודכן בהצלחה

source: Edit Profile
ar: تعديل الملف الشخصي
he: ערוך פרופיל

# confirmSaveChanges
source: Are you sure you want to save the changes?
ar: هل أنت متأكد أنك تريد حفظ التغييرات؟
he: האם אתה בטוח שברצונך לשמור את השינויים?

source: Cancel
ar: إلغاء
he: ביטול

source: Save changes
ar: حفظ التغييرات
he: שמור שינויים

# confirmLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
he: האם אתה בטוח שברצונך להתנתק?

source: Logout
ar: تسجيل الخروج
he: התנתק

source: Order Lesson
ar: طلب درس
he: הזמן שיעור

source: Title
ar: العنوان
he: כותרת

source: Title cannot be empty
ar: لا يمكن أن يكون العنوان فارغًا
he: הכותרת לא יכולה להיות ריקה

# dateTimeMustBeInTheFuture
source: Date and time must {minutes} minutes in the future
ar: يجب أن يكون التاريخ والوقت بعد {minutes} دقيقة في المستقبل
he: תאריך ושעה צריכים להיות לפחות {minutes} דקות בעתיד

source: Select duration
ar: اختر المدة
he: בחר משך זמן

# minutes
source: {minutes} minutes
ar: {minutes} دقيقة
he: {minutes} דקות

# hours
source: {hours} hours
ar: {hours} ساعة
he: {hours} שעות

# confirmAndPay
source: Next
ar: تأكيد والمتابعة إلى الدفع
he: אשר והמשך לתשלום

# confirmLeavePaymentPage
source: Are you sure you want to leave? Your order will be cancelled.
ar: هل أنت متأكد أنك تريد المغادرة؟ سيتم إلغاء طلبك.
he: האם אתה בטוח שברצונך לעזוב? ההזמנה שלך תבוטל.

source: Leave
ar: مغادرة
he: עזוב

source: My Lessons
ar: دروسي
he: השיעורים שלי

# myLessonsDescription
source: You can view and manage your ordered lessons on this page. Tap the button at the bottom right to order a new lesson.
ar: يمكنك عرض وإدارة الدروس التي طلبتها في هذه الصفحة. اضغط على الزر في أسفل اليسار لطلب درس جديد.
he: ניתן לצפות ולנהל את השיעורים שהזמנת בעמוד זה. הקש על הכפתור בפינה השמאלית התחתונה כדי להזמין שיעור חדש.

# noLessons
source: No lessons booked
ar: لا توجد دروس محجوزة
he: אין שיעורים מוזמנים

source: Lesson Requests
ar: طلبات الدروس
he: בקשות שיעור

source: No pending lessons
ar: لا توجد دروس معلقة
he: אין שיעורים ממתינים

source: My Schedule
ar: جدولي
he: הלו״ז שלי

# myScheduleDescription
source: You can view and manage your upcoming lessons on this page. Tap the button at the bottom right to accept new lessons.
ar: يمكنك عرض وإدارة الدروس القادمة في هذه الصفحة. اضغط على الزر في أسفل اليسار لقبول دروس جديدة.
he: ניתן לצפות ולנהל את השיעורים הקרובים שלך בעמוד זה. הקש על הכפתור בפינה השמאלית התחתונה כדי לקבל שיעורים חדשים.

source: Accept Lessons
ar: قبول الدروس
he: קבל שיעורים

# lessonPending
source: Lesson pending... A teacher will be assigned soon
ar: الدرس معلق... سيتم تعيين معلم قريبًا
he: השיעור ממתין... בקרוב יוקצה מורה

# confirmCancelLesson
source: Are you sure you want to cancel the lesson?
ar: هل أنت متأكد أنك تريد إلغاء الدرس؟
he: האם אתה בטוח שברצונך לבטל את השיעור?

source: Cancel Lesson
ar: إلغاء الدرس
he: בטל שיעור

# enterLink
source: Enter the link for the virtual lesson:
ar: أدخل الرابط للدرس الافتراضي:
he: הזן את הקישור לשיעור הווירטואלי:

# confirmEditLesson
source: Are you sure you want to edit the lesson?
ar: هل أنت متأكد أنك تريد تعديل الدرس؟
he: האם אתה בטוח שברצונך לערוך את השיעור?

source: Edit Link
ar: تعديل الرابط
he: ערוך קישור

# confirmAcceptLesson
source: Are you sure you want to accept the lesson?
ar: هل أنت متأكد أنك تريد قبول الدرس؟
he: האם אתה בטוח שברצונך לקבל את השיעור?

source: Accept Lesson
ar: قبول الدرس
he: קבל שיעור

# confirmRejectLesson
source: Are you sure you want to reject the lesson?
ar: هل أنت متأكد أنك تريد رفض الدرس؟
he: האם אתה בטוח שברצונך לדחות את השיעור?

source: Reject Lesson
ar: رفض الدرس
he: דחה שיעור

source: Refresh
ar: تحديث
he: רענן

# subjectAny
source: Any Subject
ar: أي موضوع
he: כל נושא

# subjectMath
source: Math
ar: الرياضيات
he: מתמטיקה

# subjectEnglish
source: English
ar: الإنجليزية
he: אנגלית

# subjectHebrew
source: Hebrew
ar: العبرية
he: עברית

# subjectArabic
source: Arabic
ar: العربية
he: ערבית

# subjectHistory
source: History
ar: التاريخ
he: היסטוריה

# subjectGeography
source: Geography
ar: الجغرافيا
he: גיאוגרפיה

# subjectPhysics
source: Physics
ar: الفيزياء
he: פיזיקה

# subjectChemistry
source: Chemistry
ar: الكيمياء
he: כימיה

# subjectBiology
source: Biology
ar: بيولوجيا
he: ביולוגיה

# subjectComputerScience
source: Computer Science
ar: علوم الحاسوب
he: מדעי המחשב

# gradeAny
source: Any Grade
ar: أي صف
he: כל כיתה

# gradeFirst
source: First Grade
ar: الصف الأول
he: כיתה א'

# gradeSecond
source: Second Grade
ar: الصف الثاني
he: כיתה ב'

# gradeThird
source: Third Grade
ar: الصف الثالث
he: כיתה ג'

# gradeFourth
source: Fourth Grade
ar: الصف الرابع
he: כיתה ד'

# gradeFifth
source: Fifth Grade
ar: الصف الخامس
he: כיתה ה'

# gradeSixth
source: Sixth Grade
ar: الصف السادس
he: כיתה ו'

# gradeSeventh
source: Seventh Grade
ar: الصف السابع
he: כיתה ז'

# gradeEighth
source: Eighth Grade
ar: الصف الثامن
he: כיתה ח'

# gradeNinth
source: Ninth Grade
ar: الصف التاسع
he: כיתה ט'

# gradeTenth
source: Tenth Grade
ar: الصف العاشر
he: כיתה י'

# gradeEleventh
source: Eleventh Grade
ar: الصف الحادي عشر
he: כיתה י"א

# gradeTwelfth
source: Twelfth Grade
ar: الصف الثاني عشر
he: כיתה י"ב

# gradeHigherEducation
source: Higher Education
ar: التعليم العالي
he: השכלה גבוהה

# subjectHint
source: Select the subject of the lesson
ar: اختر موضوع الدرس
he: בחר את נושא השיעור

# gradeHint
source: Select the grade of the student
ar: اختر صف الطالب
he: בחר את כיתת התלמיד

source: Subject
ar: الموضوع
he: נושא

source: Grade
ar: الصف
he: כיתה

source: From Grade
ar: من الصف
he: מכיתה

source: To Grade
ar: إلى الصف
he: לכיתה

# noLink
source: A virtual meeting link will be generated shortly before the scheduled start time. Please check back later.
ar: سيتم إنشاء رابط الاجتماع الافتراضي قبل وقت قصير من الوقت المحدد. يرجى التحقق مرة أخرى لاحقًا.
he: קישור לפגישה וירטואלית ייווצר זמן קצר לפני מועד ההתחלה המתוכנן. נא לבדוק שוב מאוחר יותר.

source: Order Summary
ar: ملخص الطلب
he: סיכום הזמנה

source: Coupon Code
ar: رمز القسيمة
he: קוד קופון

source: Apply
ar: تطبيق
he: החל

# agreeRefundPolicy1
source: By continuing, you agree to the
ar: بالاستمرار، أنت توافق على
he: בהמשך, אתה מסכים ל-

# agreeRefundPolicy2
source: Refund Policy
ar: سياسة الاسترداد
he: מדיניות החזר כספי

source: My Orders
ar: طلباتي
he: ההזמנות שלי

# orderId
source: Order {orderId}
ar: الطلب {orderId}
he: הזמנה {orderId}

# dateTime
source: Time: {dateTime}
ar: الوقت: {dateTime}
he: שעה: {dateTime}

# lessonDurationDateTime
source: Lesson: {duration} minutes - {dateTime}
ar: الدرس: {duration} دقيقة - {dateTime}
he: שיעור: {duration} דקות - {dateTime}

# price
source: Price: {price}
ar: السعر: {price}
he: מחיר: {price}

source: Status: Payment Failed
ar: الحالة: فشل الدفع
he: סטטוס: תשלום נכשל

source: Status: Processing Payment
ar: الحالة: معالجة الدفع
he: סטטוס: עיבוד תשלום

source: Status: Paid
ar: الحالة: مدفوع
he: סטטוס: שולם

source: Status: Pending Refund
ar: الحالة: استرداد معلق
he: סטטוס: החזר ממתין

source: Status: Processing Refund
ar: الحالة: معالجة الاسترداد
he: סטטוס: עיבוד החזר

source: Status: Refunded
ar: الحالة: تم استرداده
he: סטטוס: הוחזר

source: Darrisni
ar: درسني
he: דריסני

source: Orders History
ar: سجل الطلبات
he: היסטוריית הזמנות

source: Lessons History
ar: سجل الدروس
he: היסטוריית שיעורים

source: Contact Us
ar: اتصل بنا
he: צור קשר

# agreeTerms1
source: I agree to the
ar: أوافق على
he: אני מסכים ל-

# agreeTerms2
source: Terms and Conditions
ar: الشروط والأحكام
he: תנאים והגבלות

# mustAgreeTerms
source: You must agree to the Terms and Conditions
ar: يجب عليك الموافقة على الشروط والأحكام
he: עליך להסכים לתנאים וההגבלות

source: Invalid coupon code
ar: رمز القسيمة غير صالح
he: קוד קופון לא חוקי

source: Next
ar: التالي
he: הבא

# overlappingLessons
source: The lesson overlaps with another lesson, please select a different time
ar: يتداخل الدرس مع درس آخر، يرجى اختيار وقت مختلف
he: השיעור מתנגש עם שיעור אחר, אנא בחר זמן שונה
